Documents/ВнутреннийДокумент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ВнутреннийДокумент</Name>
			<BasedOn>
				<xr:Item>Document.ВнутреннийДокумент</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ДолжностныеЛицаОрганизаций</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВнутреннегоДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВнутреннихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийВнутреннихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеСодержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоХозяйственнойДеятельности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоЛицензииУКПИФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоЛицензииДУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВСоответствииСЗаконодательством</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовил</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписал</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравовоеОбоснование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДолжностногоЛица</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДолжностныхЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заместитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОценки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обстоятельство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбстоятельстваВозникновенияКонфликтаИнтересов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвязанноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметКонфликта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметКонфликтаИнтересов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийДокумент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
								<v8:Type>cfg:CatalogRef.ВидыДеятельности</v8:Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ДолжностныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ДолжностныеЛицаОрганизаций</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДолжностногоЛица</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДолжностныхЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсполняющийОбязанности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ВнутреннийДокумент/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("ЭтоФормаРаспорядительногоДокумента", ЭтаФорма.ЭтоФормаРаспорядительногоДокумента);
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры // ПриСозданииНаСервере

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры
	
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтаФорма.ИзменениеСоставаДолжностныхЛиц 
		И Не ЗначениеЗаполнено(Объект.ВидОперации) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле 'Вид изменения состава должностных лиц' не заполнено", Объект.Ссылка, "Объект.ВидОперации",, Отказ); 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЭтаФорма.ЭтоФормаРаспорядительногоДокумента
		И Не ЗначениеЗаполнено(Объект.ВидВнутреннегоДокумента) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле 'Вид документа' не заполнено", Объект.Ссылка, "Объект.ВидВнутреннегоДокумента",, Отказ); 
		
	КонецЕсли; 
	
	Если ЭтаФорма.ЭтоРаспорядительныйДокумент Тогда
	
		ИнформацияОЗамещении = ПолучитьИнформациюОЗамещении(Объект.Дата, Объект.Организация, Объект.Подписал);
		
		Если ЗначениеЗаполнено(ИнформацияОЗамещении.Замещающий) Тогда
		
			ТекстВопроса = СтрШаблон("На период с %1 по %2 обязанности сотрудника %3 исполняет %4", 
				Формат(ИнформацияОЗамещении.ДатаНачала, "ДФ=dd.MM.yyyy"),
				Формат(ИнформацияОЗамещении.ДатаОкончания, "ДФ=dd.MM.yyyy"),
				ИнформацияОЗамещении.ДолжностноеЛицо, 
				ИнформацияОЗамещении.Замещающий, 
				);
				
			ВариантыОтвета = Новый СписокЗначений;
			ВариантыОтвета.Добавить(КодВозвратаДиалога.Да, "Заменить подписанта");
			ВариантыОтвета.Добавить(КодВозвратаДиалога.Нет, "Оставить текущего");
			ВариантыОтвета.Добавить(КодВозвратаДиалога.Отмена, "Отменить");
						
			Ответ = Вопрос(ТекстВопроса, ВариантыОтвета, , КодВозвратаДиалога.Да);
			
			Если Ответ = КодВозвратаДиалога.Да Тогда
				Объект.Подписал = ИнформацияОЗамещении.Замещающий;
			ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда 
				Отказ = Истина;
			КонецЕсли; 
			
		КонецЕсли;
	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ЭтаФорма.ИзменениеСоставаДолжностныхЛиц Тогда
	
		ТекущийОбъект.ВидОперации = Неопределено;
	
	КонецЕсли; 
	
	Если ЭтаФорма.ЭтоРешениеОбОтказеОтПредотвращенияКИ И Не Отказ Тогда
		
		ТекущийОбъект.Параметры.Очистить();
		
		Если ЭтаФорма.ОтборУстановлен Тогда
		
			ДобавитьСтрокиПараметров(ТекущийОбъект, "ОтборПоВидуЛицензии");
			ДобавитьСтрокиПараметров(ТекущийОбъект, "ОтборПоКлиентам");
			ДобавитьСтрокиПараметров(ТекущийОбъект, "ОтборПоСчетамДУ");			
		
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокиПараметров(ТекущийОбъект, ИмяОтбора)

	Если ЭтаФорма[ИмяОтбора + "Использование"] Тогда
		Для каждого СтрокаОтбора Из ЭтаФорма[ИмяОтбора] Цикл
			ЗаполнитьЗначенияСвойств(ТекущийОбъект.Параметры.Добавить(), СтрокаОтбора);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	ЭтаФорма.ИсходнаяДатаДокумента = ТекущийОбъект.Дата;
	
	Если (ЭтаФорма.ЭтоФормаРаспорядительногоДокумента Или ЭтаФорма.ЭтоРаспорядительныйДокумент)
		И ЗначениеЗаполнено(ЭтаФорма.ПараметрыПересмотра.ДатаПересмотра) И Не ЗначениеЗаполнено(ЭтаФорма.ПараметрыПересмотра.ЗадачаНаПересмотр) Тогда
	
		СоздатьЗадачуНаПересмотр(ТекущийОбъект);
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область Обработчики_событий_элементов_формы

&НаКлиенте
Процедура ВидВнутреннегоДокументаПриИзменении(Элемент)
	
	ЗаполнитьФлагиПоВидамДокументов(ЭтаФорма);
	ОбновитьСвойстваЭлементовФормы(ЭтаФорма);
	
	Если ЭтаФорма.ЭтоФормаРаспорядительногоДокумента Или ЭтаФорма.ЭтоРаспорядительныйДокумент Тогда
			
		УстановитьПереключательТипа(ЭтаФорма.ТипПодписал, Объект.Подписал);
		
		Если ЭтаФорма.ЭтоНазначениеИО И Не ЗначениеЗаполнено(Объект.ДатаОценки) Тогда
			Объект.ДатаОценки = Объект.ДатаУтверждения;
		КонецЕсли;  
		
		ЗаполнитьПараметрыПересмотра();
		ЗаполнитьГиперссылкуПараметрыПересмотра(ЭтаФорма); 
		
	КонецЕсли;
	
	Если ЭтаФорма.ЭтоРешение Или ЭтаФорма.ЭтоПротокол Тогда
		Объект.ВидДолжностногоЛица = ПредопределенноеЗначение("Перечисление.ВидыДолжностныхЛиц.Руководитель");
	КонецЕсли; 
	
	УстановитьПереключательТипа(ЭтаФорма.ТипПодготовил, Объект.Подготовил);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипПодготовилПриИзменении(Элемент)
	
	Если ЭтаФорма.ТипПодготовил = 1 Тогда
		Объект.Подготовил = ПредопределенноеЗначение("Справочник.ЮрФизЛица.ПустаяСсылка");
	ИначеЕсли ЭтаФорма.ТипПодготовил = 2 Тогда
		Объект.Подготовил = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипПодписалПриИзменении(Элемент)
	
	Если ЭтаФорма.ТипПодписал = 1 Тогда
		Объект.Подписал = ПредопределенноеЗначение("Справочник.ЮрФизЛица.ПустаяСсылка");
	ИначеЕсли ЭтаФорма.ТипПодписал = 2 Тогда
		Объект.Подписал = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВСоответствииСЗаконодательствомПриИзменении(Элемент)
	ОбновитьЭлементыВСоответсвииСЗаконодательством(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	ЗаполнитьФлагиПоВидамДокументов(ЭтаФорма);
	ОбновитьСвойстваЭлементовФормы(ЭтаФорма);
	
	Если ЭтаФорма.ЭтоНазначениеИО И Не ЗначениеЗаполнено(Объект.ДатаОценки) Тогда
		Объект.ДатаОценки = Объект.Дата;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеСоставаДолжностныхЛицПриИзменении(Элемент)
	
	Элементы.ВидОперации.Видимость = ЭтаФорма.ИзменениеСоставаДолжностныхЛиц;
	ЗаполнитьФлагиПоВидамДокументов(ЭтаФорма);
	ОбновитьСвойстваЭлементовФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СотрудникАвтоПодборНаСервере(Объект.Дата, Объект.Организация, Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ЗаместительАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СотрудникАвтоПодборНаСервере(Объект.Дата, Объект.Организация, Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаПараметрыПересмотраНажатие(Элемент)
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.ПараметрыПересмотра.ЗадачаНаПересмотр) Тогда
		
		Если Не ЭтаФорма.ПараметрыПересмотра.ДоступноДобавлениеЗадач Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Недостаточно прав для установки даты пересмотра");
		ИначеЕсли ВвестиДату(ЭтаФорма.ПараметрыПересмотра.ДатаПересмотра, "Пересмотреть", ЧастиДаты.Дата) Тогда
			ЭтаФорма.Модифицированность = Истина;
		КонецЕсли;
		
	Иначе
		
		СписокДействий = Новый СписокЗначений;
		Если ЭтаФорма.ПараметрыПересмотра.ДоступноДобавлениеЗадач И Не ЗначениеЗаполнено(ЭтаФорма.ПараметрыПересмотра.ДатаИсполненияПересмотра) Тогда
			СписокДействий.Добавить("Выполнить");
		КонецЕсли;
		СписокДействий.Добавить("Открыть");
		СписокДействий.Добавить("Открыть список");
		
		Действие = ЭтаФорма.ВыбратьИзМеню(СписокДействий, Элемент);
		
		Если Действие = Неопределено Тогда
			Возврат;
		ИначеЕсли Действие.Значение = "Открыть" Тогда
			ОткрытьЗначение(ЭтаФорма.ПараметрыПересмотра.ЗадачаНаПересмотр);
		ИначеЕсли Действие.Значение = "Выполнить" 
			И Вопрос("Отметить задачу на пересмотр, как выполненную?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			ВыполнитьЗадачу(ЭтаФорма.ПараметрыПересмотра);
		ИначеЕсли Действие.Значение = "Открыть список" Тогда
			Отбор = Новый Структура("Основание", Объект.Ссылка);
			ОткрытьФормуМодально("Задача.ЗадачаИсполнителя.Форма.ФормаСписка", Новый Структура("Отбор", Отбор));
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнитьГиперссылкуПараметрыПересмотра(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбластьДействияПриИзменении(Элемент)
	ОбновитьСвойстваЭлементовФормы(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоКлиентамИспользованиеПриИзменении(Элемент)
	ОбновитьСвойстваЭлементовФормы(ЭтаФорма);	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоВидуЛицензииИспользованиеПриИзменении(Элемент)
	ОбновитьСвойстваЭлементовФормы(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоСчетамДУИспользованиеПриИзменении(Элемент)
	ОбновитьСвойстваЭлементовФормы(ЭтаФорма);	
КонецПроцедуры

#КонецОбласти

#Область Служебные_процедуры_и_функции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьФлагиПоВидамДокументов(ЭтаФорма)

	ВидВнутреннегоДокумента = ЭтаФорма.Объект.ВидВнутреннегоДокумента;
	ВидОперации = ЭтаФорма.Объект.ВидОперации;
	
	Если ЗначениеЗаполнено(ВидВнутреннегоДокумента) Тогда
		
		ЗначенияФлагов = ПолучитьЗначенияФлаговПоВидамДокументов(ВидВнутреннегоДокумента, ВидОперации);
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ЗначенияФлагов);
		
	Иначе
		
		ЭтаФорма.ЭтоРаспорядительныйДокумент = Ложь;
		ЭтаФорма.ЭтоНазначениеИО = Ложь;
		
	КонецЕсли; 

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначенияФлаговПоВидамДокументов(ВидВнутреннегоДокумента, ВидОперации)

	ВидыДокументов = Справочники.ВидыВнутреннихДокументов;
	ВидыОпераций = Перечисления.ВидыОперацийВнутреннихДокументов;
	
	ЗначенияФлагов = Новый Структура;
	
	ЗначенияФлагов.Вставить("ЭтоРаспорядительныйДокумент", ВидВнутреннегоДокумента.ПринадлежитЭлементу(ВидыДокументов.Распорядительные));
	ЗначенияФлагов.Вставить("ЭтоПриказ", ВидВнутреннегоДокумента = ВидыДокументов.Приказ);
	ЗначенияФлагов.Вставить("ЭтоРешение", ВидВнутреннегоДокумента = ВидыДокументов.Решение);
	ЗначенияФлагов.Вставить("ЭтоРешениеОбОтказеОтПредотвращенияКИ", ВидВнутреннегоДокумента = ВидыДокументов.РешениеОбОтказеОтПредотвращенияКИ);
	ЗначенияФлагов.Вставить("ЭтоПротокол", ВидВнутреннегоДокумента = ВидыДокументов.Протокол);
	ЗначенияФлагов.Вставить("ЭтоНазначениеДЛ", ВидОперации = ВидыОпераций.НазначениеДолжностногоЛица);
	ЗначенияФлагов.Вставить("ЭтоСнятиеДЛ", ВидОперации = ВидыОпераций.СнятиеДолжностногоЛица);
	ЗначенияФлагов.Вставить("ЭтоНазначениеИО", ВидОперации = ВидыОпераций.НазначениеИсполняющегоОбязанности);
	ЗначенияФлагов.Вставить("ЭтоПрекращениеИО", ВидОперации = ВидыОпераций.ПрекращениеИсполненияОбязанностей);
		
	Возврат ЗначенияФлагов;

КонецФункции 

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	ЭтаФорма.ИзменениеСоставаДолжностныхЛиц = ЗначениеЗаполнено(Объект.ВидОперации);
	ЭтаФорма.ИсходнаяДатаДокумента = Объект.Дата;
	
	// т.к. страницами удобно пользоваться на этапе разработки, отключим их на этапе исполнения
	Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	
	ЗаполнитьФлагиПоВидамДокументов(ЭтаФорма);
	ПараметрыВыбораВидаДокумента = Новый Массив;
	
	Если ЭтаФорма.ЭтоФормаРаспорядительногоДокумента Или ЭтаФорма.ЭтоРаспорядительныйДокумент Тогда
		
		Если ЭтаФорма.ЭтоФормаРаспорядительногоДокумента Тогда
		
			ПараметрыВыбораВидаДокумента.Добавить(Новый ПараметрВыбора("Отбор.Родитель", ПредопределенноеЗначение("Справочник.ВидыВнутреннихДокументов.Распорядительные")));
		
		КонецЕсли; 
		
		Если Параметры.Свойство("ЗначениеКопирования") И Не Параметры.ЗначениеКопирования.Пустая() Тогда
				
			ЗаполнитьЗначенияСвойств(Объект, Параметры.ЗначениеКопирования, 
				"НаименованиеДокумента, КраткоеСодержание, Подготовил, Подписал");
			
		КонецЕсли;
		
		Если ЭтаФорма.ЭтоРешениеОбОтказеОтПредотвращенияКИ Тогда
		
			ЗаполнитьОтборыДляРешенияОбОтказеОтПредотвращенияКИ();
			ЭтаФорма.ОтборПоВидуЛицензииИспользование = ЭтаФорма.ОтборПоВидуЛицензии.Количество() > 0;
			ЭтаФорма.ОтборПоКлиентамИспользование = ЭтаФорма.ОтборПоКлиентам.Количество() > 0;
			ЭтаФорма.ОтборПоСчетамДУИспользование = ЭтаФорма.ОтборПоСчетамДУ.Количество() > 0;
			
			ЭтаФорма.ОтборУстановлен = (ЭтаФорма.ОтборПоВидуЛицензииИспользование Или ЭтаФорма.ОтборПоКлиентамИспользование 
				Или ЭтаФорма.ОтборПоСчетамДУИспользование);
		
		КонецЕсли;
		
		ЗаполнитьПараметрыПересмотра();
		ЗаполнитьГиперссылкуПараметрыПересмотра(ЭтаФорма);
		
	КонецЕсли;
	
	ОбновитьСвойстваЭлементовФормы(ЭтаФорма);
	
	УстановитьПереключательТипа(ЭтаФорма.ТипПодготовил, Объект.Подготовил);
	УстановитьПереключательТипа(ЭтаФорма.ТипПодписал, Объект.Подписал);
		
	Элементы.ВидВнутреннегоДокумента.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораВидаДокумента);
	ОбновитьЭлементыВСоответсвииСЗаконодательством(ЭтаФорма);
	
КонецПроцедуры // ПриЧтенииСозданииНаСервере

&НаСервере
Процедура ЗаполнитьОтборыДляРешенияОбОтказеОтПредотвращенияКИ();

    СоответствиеТипов = Новый Соответствие;
	СоответствиеТипов.Вставить(Тип("СправочникСсылка.СчетаДоверительногоУправления"), ЭтаФорма.ОтборПоСчетамДУ);
	СоответствиеТипов.Вставить(Тип("СправочникСсылка.ЮрФизЛица"), ЭтаФорма.ОтборПоКлиентам);
	СоответствиеТипов.Вставить(Тип("СправочникСсылка.ВидыДеятельности"), ЭтаФорма.ОтборПоВидуЛицензии);
	
	ЭтаФорма.ОтборПоСчетамДУ.Очистить();
	ЭтаФорма.ОтборПоКлиентам.Очистить();
	ЭтаФорма.ОтборПоВидуЛицензии.Очистить();
	
	Для каждого СтрокаПараметры Из Объект.Параметры Цикл
	
		ТипЗначения = ТипЗнч(СтрокаПараметры.Значение);
		ЭлементФормы = СоответствиеТипов[ТипЗначения];
		ЭлементФормы.Добавить(СтрокаПараметры.Значение);
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьСвойстваЭлементовФормы(ЭтаФорма)

	Элементы = ЭтаФорма.Элементы;
	
	Элементы.ГруппаВнутреннийДокумент.Видимость = Не (ЭтаФорма.ЭтоФормаРаспорядительногоДокумента Или ЭтаФорма.ЭтоРаспорядительныйДокумент);
	Элементы.ГруппаРаспорядительныйДокумент.Видимость = ЭтаФорма.ЭтоФормаРаспорядительногоДокумента Или ЭтаФорма.ЭтоРаспорядительныйДокумент;
	Элементы.ГруппаРешениеОбОтказе.Видимость = ЭтаФорма.ЭтоРешениеОбОтказеОтПредотвращенияКИ;
	
	Элементы.ИзменениеСоставаДолжностныхЛиц.Видимость = ЭтаФорма.ЭтоПриказ Или ЭтаФорма.ЭтоРешение Или ЭтаФорма.ЭтоПротокол;
	Элементы.ВидОперации.Видимость = ЭтаФорма.ИзменениеСоставаДолжностныхЛиц;
	Элементы.Основание.Видимость = Не ЭтаФорма.ИзменениеСоставаДолжностныхЛиц;
	
	ФормаКомандаПечатьВыпискиИзРеестраКонтроляОценки = ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаПечать.ПодчиненныеЭлементы.ФормаКомандаПечатьВыпискиИзРеестраКонтроляОценки;
	
	Если ЭтаФорма.ИзменениеСоставаДолжностныхЛиц Тогда
	
		Элементы.ВидДолжностногоЛица.Видимость = ЭтаФорма.ЭтоНазначениеИО Или ЭтаФорма.ЭтоПрекращениеИО Или ЭтаФорма.ЭтоНазначениеДЛ Или ЭтаФорма.ЭтоСнятиеДЛ;
		Элементы.Сотрудник.Видимость = ЭтаФорма.ЭтоНазначениеИО Или ЭтаФорма.ЭтоНазначениеДЛ Или ЭтаФорма.ЭтоСнятиеДЛ;
		Элементы.Сотрудник.АвтоотметкаНезаполненного = ЭтаФорма.ЭтоНазначениеДЛ Или ЭтаФорма.ЭтоСнятиеДЛ;
		
		Элементы.Заместитель.Видимость = ЭтаФорма.ЭтоНазначениеИО Или ЭтаФорма.ЭтоПрекращениеИО;
		Элементы.ДатаОценки.Видимость = ЭтаФорма.ЭтоНазначениеИО;
		ФормаКомандаПечатьВыпискиИзРеестраКонтроляОценки.Видимость = ЭтаФорма.ЭтоНазначениеИО Или ЭтаФорма.ЭтоНазначениеДЛ;
		Элементы.ДатаОкончанияДействия.Видимость = Не (ЭтаФорма.ЭтоПрекращениеИО Или ЭтаФорма.ЭтоСнятиеДЛ);
		
		Элементы.ВидДолжностногоЛица.Доступность = Не (ЭтаФорма.ЭтоРешение Или ЭтаФорма.ЭтоПротокол);	
		
	Иначе
		
		Элементы.ВидДолжностногоЛица.Видимость = Ложь;
		Элементы.Сотрудник.Видимость = Ложь;
		Элементы.Заместитель.Видимость = Ложь;
		Элементы.ДатаОценки.Видимость = Ложь;
		Элементы.ДатаОкончанияДействия.Видимость = Истина;
		ФормаКомандаПечатьВыпискиИзРеестраКонтроляОценки.Видимость = Ложь;
		
	КонецЕсли; 
	
	Если ЭтаФорма.ЭтоРешениеОбОтказеОтПредотвращенияКИ Тогда
		
		Элементы.ГруппаОбластьДействия.Видимость = ЭтаФорма.ОтборУстановлен;
		
		Элементы.ОтборПоСчетамДУ.Видимость = ЭтаФорма.ОтборПоСчетамДУИспользование;
		Элементы.ОтборПоКлиентам.Видимость = ЭтаФорма.ОтборПоКлиентамИспользование;
		Элементы.ОтборПоВидуЛицензии.Видимость = ЭтаФорма.ОтборПоВидуЛицензииИспользование;
		
		Элементы.ОтборПоСчетамДУИспользование.Доступность = Не (ЭтаФорма.ОтборПоКлиентамИспользование
			Или ЭтаФорма.ОтборПоВидуЛицензииИспользование);
		Элементы.ОтборПоКлиентамИспользование.Доступность = Не ЭтаФорма.ОтборПоСчетамДУИспользование;
		Элементы.ОтборПоВидуЛицензииИспользование.Доступность = Не ЭтаФорма.ОтборПоСчетамДУИспользование;
	
		Элементы.КраткоеСодержание1.Заголовок = "Принимаемые меры";
		
	Иначе
		
		Элементы.КраткоеСодержание1.Заголовок = "Содержание";
		
	КонецЕсли;
	
	Если ЭтаФорма.ЭтоРешение Или ЭтаФорма.ЭтоПротокол Тогда
		
		МассивДоступныхВидовОпераций = Новый Массив;
		МассивДоступныхВидовОпераций.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийВнутреннихДокументов.НазначениеДолжностногоЛица"));
		МассивДоступныхВидовОпераций.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийВнутреннихДокументов.СнятиеДолжностногоЛица"));
		НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(МассивДоступныхВидовОпераций));
		МассивПараметровВыбора = Новый Массив();
		МассивПараметровВыбора.Добавить(НовыйПараметр);
		Элементы.ВидОперации.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
		
	Иначе
		Элементы.ВидОперации.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);
	КонецЕсли; 
	
	Если ЭтаФорма.ЭтоПриказ Тогда
		Элементы.НаименованиеДокумента1.ПодсказкаВвода = "Будет заполнено автоматически при записи документа";
		Элементы.НаименованиеДокумента1.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.Отображать;
		Элементы.НаименованиеДокумента1.ОтметкаНезаполненного = Ложь;
		Элементы.НаименованиеДокумента1.АвтоОтметкаНезаполненного = Ложь;
	Иначе
		Элементы.НаименованиеДокумента1.ПодсказкаВвода = "";
		Элементы.НаименованиеДокумента1.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.Авто;
		Элементы.НаименованиеДокумента1.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПереключательТипа(Переключатель, Владелец)

	Если ТипЗнч(Владелец) = Тип("СправочникСсылка.ЮрФизЛица") Тогда
		Переключатель = 1;
	ИначеЕсли ТипЗнч(Владелец) = Тип("Строка") Тогда
		Переключатель = 2;
	Иначе // Неопределено
		Переключатель = 1;
		Владелец = Справочники.ЮрФизЛица.ПустаяСсылка();
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьЭлементыВСоответсвииСЗаконодательством(ЭтаФорма)

	ЭтаФорма.Элементы.ВСоответствииСЗаконодательством.Заголовок = "В соответствии с законодательством в отношении УК"; 
		
	Если ЭтаФорма.Объект.ВСоответствииСЗаконодательством Тогда
		ЭтаФорма.Элементы.ВСоответствииСЗаконодательством.Заголовок = ЭтаФорма.Элементы.ВСоответствииСЗаконодательством.Заголовок + ":";
		ЭтаФорма.Элементы.ПравовоеОбоснование.Видимость = Истина;
	Иначе
		ЭтаФорма.Элементы.ПравовоеОбоснование.Видимость = Ложь;
	КонецЕсли; 

КонецПроцедуры
 
&НаКлиенте
Процедура Подключаемый_ОткрытьПрисоединенныеФайлы()

	РаботаСФайловымХранилищемКлиент.ОткрытьПрисоединенныеФайлы(Объект.Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура ДатаУтверждения1ПриИзменении(Элемент)
	
	Если НачалоДня(Объект.Дата) <> НачалоДня(ЭтаФорма.ИсходнаяДатаДокумента) Тогда
		
		Если ЭтаФорма.ЭтоПриказ Тогда
		
			НаименованиеПоШаблону = СтрШаблон("Приказ №%1 от %2 г.", 
				СокрЛП(Объект.Номер),
				Формат(ЭтаФорма.ИсходнаяДатаДокумента, "ДФ=dd.MM.yyyy"));
				
			Если НаименованиеПоШаблону = Объект.НаименованиеДокумента Тогда
			
				Объект.НаименованиеДокумента = "";
			
			КонецЕсли;
		
		КонецЕсли;
		
		Объект.Номер = "";
		
	КонецЕсли;
	
	Если ЭтаФорма.ЭтоНазначениеИО Тогда
		
		Если Не ЗначениеЗаполнено(Объект.ДатаОценки) Или 
			(Объект.ДатаОценки <> НачалоДня(Объект.Дата) 
				И Вопрос("Обновить дату оценки замещающего?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да) Тогда
		
			Объект.ДатаОценки = Объект.Дата;
		
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КомандаПечатьВыпискиИзРеестраКонтроляОценкиНаСервере(Ссылка)
	
	Возврат Документы.ВнутреннийДокумент.ПечатьВыпискиИзРеестраКонтроляОценки(Ссылка);	
	
КонецФункции

&НаКлиенте
Процедура КомандаПечатьВыпискиИзРеестраКонтроляОценки(Команда)
	
	ТабДок = КомандаПечатьВыпискиИзРеестраКонтроляОценкиНаСервере(Объект.Ссылка);
	ТабДок.Показать();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СотрудникАвтоПодборНаСервере(Дата, Организация, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СправочникСотрудники.Ссылка КАК Ссылка,
		|	СправочникСотрудники.ВидЗанятости КАК ВидЗанятости,
		|	СотрудникиОрганизацииНаДату.Должность КАК Должность
		|ИЗ
		|	Справочник.Сотрудники КАК СправочникСотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиОрганизации.СрезПоследних(&Период, Организация = &Организация) КАК СотрудникиОрганизацииНаДату
		|		ПО СправочникСотрудники.Ссылка = СотрудникиОрганизацииНаДату.Сотрудник
		|ГДЕ
		|	СправочникСотрудники.Организация = &Организация
		|	И СправочникСотрудники.Наименование ПОДОБНО ""%"" + &СтрокаПоиска + ""%""
		|	И ЕСТЬNULL(СотрудникиОрганизацииНаДату.ВидСобытия, ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)) <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СправочникСотрудники.Наименование,
		|	Должность,
		|	ВидЗанятости
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СтрокаПоиска", Текст);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Пока Выборка.Следующий() Цикл
		
		Представление = СтрШаблон("%1 - %2 (%3)", Выборка.Ссылка, Выборка.Должность, Выборка.ВидЗанятости);
		ДанныеВыбора.Добавить(Выборка.Ссылка, Представление);
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИнформациюОЗамещении(Период, Организация, Подписант)

	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДолжностныеЛицаОрганизацийСрезПоследних.Организация КАК Организация,
		|	ДолжностныеЛицаОрганизацийСрезПоследних.ВидДолжностногоЛица КАК ВидДолжностногоЛица,
		|	ДолжностныеЛицаОрганизацийСрезПоследних.ИсполняющийОбязанности КАК ИсполняющийОбязанности,
		|	ДолжностныеЛицаОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
		|	ДолжностныеЛицаОрганизацийСрезПоследних.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ _ДолжностныеЛица
		|ИЗ
		|	РегистрСведений.ДолжностныеЛицаОрганизаций.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И ВидДолжностногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыДолжностныхЛиц.Руководитель)) КАК ДолжностныеЛицаОрганизацийСрезПоследних
		|ГДЕ
		|	ДолжностныеЛицаОрганизацийСрезПоследних.Сотрудник.ЮрФизЛицо = &ЮрФизЛицо
		|	И (НЕ ДолжностныеЛицаОрганизацийСрезПоследних.ИсполняющийОбязанности
		|			ИЛИ ДолжностныеЛицаОрганизацийСрезПоследних.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ ДолжностныеЛицаОрганизацийСрезПоследних.ДатаОкончания >= &Период)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДолжностныеЛица.Сотрудник.ЮрФизЛицо КАК ДолжностноеЛицо,
		|	Замещающие.ДатаНачала КАК ДатаНачала,
		|	Замещающие.Замещающий КАК Замещающий,
		|	Замещающие.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	_ДолжностныеЛица КАК _ДолжностныеЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ДолжностныеЛицаОрганизацийСрезПоследних.Период КАК ДатаНачала,
		|			ДолжностныеЛицаОрганизацийСрезПоследних.Сотрудник.ЮрФизЛицо КАК Замещающий,
		|			ДолжностныеЛицаОрганизацийСрезПоследних.ДатаОкончания КАК ДатаОкончания
		|		ИЗ
		|			РегистрСведений.ДолжностныеЛицаОрганизаций.СрезПоследних(
		|					&Период,
		|					(Организация, ВидДолжностногоЛица, ИсполняющийОбязанности) В
		|						(ВЫБРАТЬ
		|							_ДолжностныеЛица.Организация,
		|							_ДолжностныеЛица.ВидДолжностногоЛица,
		|							ИСТИНА
		|						ИЗ
		|							_ДолжностныеЛица КАК _ДолжностныеЛица)) КАК ДолжностныеЛицаОрганизацийСрезПоследних
		|		ГДЕ
		|			ДолжностныеЛицаОрганизацийСрезПоследних.ДатаОкончания >= &Период) КАК Замещающие
		|		ПО _ДолжностныеЛица.Сотрудник.ЮрФизЛицо <> Замещающие.Замещающий";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ЮрФизЛицо", Подписант);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ИнформацияОЗамещении = Новый Структура("ДолжностноеЛицо, Замещающий, ДатаНачала, ДатаОкончания");
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ИнформацияОЗамещении, Выборка);
	КонецЕсли; 
	
	Возврат ИнформацияОЗамещении;
	
КонецФункции 

&НаСервере
Процедура ЗаполнитьПараметрыПересмотра()
	
	ЭтаФорма.ПараметрыПересмотра = Новый Структура("ЗадачаНаПересмотр, ДатаПересмотра, ДатаИсполненияПересмотра");
	ЭтаФорма.ПараметрыПересмотра.Вставить("ДоступноДобавлениеЗадач", ПравоДоступа("Добавление", Метаданные.Задачи.ЗадачаИсполнителя)); 
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	#Область Текст_запроса
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ЗадачаИсполнителя.Ссылка КАК ЗадачаНаПересмотр,
		|	ЗадачаИсполнителя.СрокИсполнения КАК ДатаПересмотра,
		|	ЗадачаИсполнителя.ДатаВыполнения КАК ДатаИсполненияПересмотра,
		|	1 КАК Порядок
		|ПОМЕСТИТЬ _ОжидаетПересмотра
		|ИЗ
		|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
		|ГДЕ
		|	НЕ ЗадачаИсполнителя.ПометкаУдаления
		|	И ЗадачаИсполнителя.Основание = &Основание
		|	И НЕ ЗадачаИсполнителя.Выполнена
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗадачаИсполнителя.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ЗадачаИсполнителя.Ссылка КАК ЗадачаНаПересмотр,
		|	ЗадачаИсполнителя.СрокИсполнения КАК ДатаПересмотра,
		|	ЗадачаИсполнителя.ДатаВыполнения КАК ДатаИсполненияПересмотра,
		|	2 КАК Порядок
		|ПОМЕСТИТЬ _Пересмотрен
		|ИЗ
		|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
		|ГДЕ
		|	НЕ ЗадачаИсполнителя.ПометкаУдаления
		|	И ЗадачаИсполнителя.Основание = &Основание
		|	И ЗадачаИсполнителя.Выполнена
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗадачаИсполнителя.Дата УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	_ОжидаетПересмотра.ЗадачаНаПересмотр КАК ЗадачаНаПересмотр,
		|	_ОжидаетПересмотра.ДатаПересмотра КАК ДатаПересмотра,
		|	_ОжидаетПересмотра.ДатаИсполненияПересмотра КАК ДатаИсполненияПересмотра,
		|	_ОжидаетПересмотра.Порядок КАК Порядок
		|ИЗ
		|	_ОжидаетПересмотра КАК _ОжидаетПересмотра
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Пересмотрен.ЗадачаНаПересмотр,
		|	_Пересмотрен.ДатаПересмотра,
		|	_Пересмотрен.ДатаИсполненияПересмотра,
		|	_Пересмотрен.Порядок
		|ИЗ
		|	_Пересмотрен КАК _Пересмотрен
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";		
	#КонецОбласти
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Основание", Объект.Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма.ПараметрыПересмотра, Выборка);
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура СоздатьЗадачуНаПересмотр(ТекущийОбъект)

	Если ТекущийОбъект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ") Тогда
		ГруппаИсполнителей = ОбщегоНазначения.ПолучитьИменованныйОбъект("ГруппаПользователей_ПересмотрПриказовТраст");
	ИначеЕсли ТекущийОбъект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ") Тогда
		ГруппаИсполнителей = ОбщегоНазначения.ПолучитьИменованныйОбъект("ГруппаПользователей_ПересмотрПриказовРЭМ");
	Иначе
		Возврат;
	КонецЕсли;
	
	ЗадачаНаПересмотр = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
	ЗадачаНаПересмотр.Дата = ТекущаяДатаСеанса();
	ЗадачаНаПересмотр.Наименование = "Пересмотр приказа";
	ЗадачаНаПересмотр.Организация = ТекущийОбъект.Организация;
	ЗадачаНаПересмотр.ГруппаИсполнителей = ГруппаИсполнителей;
	ЗадачаНаПересмотр.Основание = ТекущийОбъект.Ссылка;
	ЗадачаНаПересмотр.ТекстЗадачи = "Пересмотреть приказ " + ТекущийОбъект.НаименованиеДокумента;
	ЗадачаНаПересмотр.Комментарий = "";
	ЗадачаНаПересмотр.СрокИсполнения = ЭтаФорма.ПараметрыПересмотра.ДатаПересмотра;
	ЗадачаНаПересмотр.Записать();
	
	ЭтаФорма.ПараметрыПересмотра.ЗадачаНаПересмотр = ЗадачаНаПересмотр.Ссылка;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьГиперссылкуПараметрыПересмотра(ЭтаФорма)
	
	ПараметрыПересмотра = ЭтаФорма.ПараметрыПересмотра;
	
	Если ЗначениеЗаполнено(ПараметрыПересмотра.ДатаИсполненияПересмотра) Тогда
		ПредставлениеПараметровПересмотра = "Пересмотрен " + Формат(ПараметрыПересмотра.ДатаИсполненияПересмотра, "ДФ=dd.MM.yyyy");
	ИначеЕсли ЗначениеЗаполнено(ПараметрыПересмотра.ДатаПересмотра) Тогда
		ПредставлениеПараметровПересмотра = "Необходимо пересмотреть " + Формат(ПараметрыПересмотра.ДатаПересмотра, "ДФ=dd.MM.yyyy");
	Иначе
		ПредставлениеПараметровПересмотра = "Параметры пересмотра не заданы";
	КонецЕсли;
	
	ЭтаФорма.Элементы.ГиперссылкаПараметрыПересмотра.Заголовок = ПредставлениеПараметровПересмотра;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыполнитьЗадачу(ПараметрыПересмотра)

	ЗадачаВыполнена = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыПересмотра.ЗадачаНаПересмотр, "Выполнена"); 
		
	Если Не ЗадачаВыполнена Тогда
		
		ЗадачаОбъект = ПараметрыПересмотра.ЗадачаНаПересмотр.ПолучитьОбъект();
		ЗадачаОбъект.ВыполнитьЗадачу(); 
		ПараметрыПересмотра.ДатаИсполненияПересмотра = ЗадачаОбъект.ДатаВыполнения;
		
	КонецЕсли

КонецПроцедуры

#КонецОбласти
